Repository: ivan029/cloudstack-docs-admin
Catalog: source/locale/*/LC_MESSAGES/networking/remote_access_vpn.po
Languages: fr_fr

source: Remote Access VPN
fr_fr: Accès distant VPN

source: CloudStack account owners can create virtual private networks (VPN) to access their virtual machines. If the guest network is instantiated from a network offering that offers the Remote Access VPN service, the virtual router (based on the System VM) is used to provide the service. CloudStack provides a L2TP-over-IPsec-based remote access VPN service to guest virtual networks. Since each network gets its own virtual router, VPNs are not shared across the networks. VPN clients native to `Windows, Mac OS X <networking/using_remote_access.html>`_ and iOS can be used to connect to the guest networks. The account owner can create and manage users for their VPN. CloudStack does not use its account database for this purpose but uses a separate table. The VPN user database is shared across all the VPNs created by the account owner. All VPN users get access to all VPNs created by the account owner.
fr_fr: Les propriétaires d'un compte CloudStack peuvent créer des réseaux virtuels privés (VPN) pour accéder à leurs machines virtuelles. Si le réseau invité est instancié depuis une offre de réseau qui propose le service d'Accès Distant VPN, le routeur virtuel (basé sur la VM Système) est utilisé pour fournir le service. CloudStack fourni un service VPN d'accès distant basé sur L2TP-over-IPsec aux réseaux virtuels invités. Chaque réseau possédant son propre routeur virtuel, les VPN ne sont pas partagés entre les réseaux. Les clients VPN natifs `Windows, Mac OS X <networking/using_remote_access.html>`_ et iOS peuvent être utilisés pour la connexion aux réseaux invités. Le propriétaire du compte peut créer et gérer les utilisateurs de son VPN. CloudStack n'utilise pas sa base de données de comptes dans ce cas mais utilise une table séparée. La base de données d'utilisateurs VPN est partagée entre tous les VPN créés par le propriétaire du compte. Tous les utilisateurs VPN ont accès à tous les VPN créés par le propriétaire du compte.

source: Make sure that not all traffic goes through the VPN. That is, the route installed by the VPN should be only for the guest network and not for all traffic.
fr_fr: Assurez vous que tout le trafic ne passe pas par le VPN. C'est-à-dire que la route mise en place par le VPN devrait être uniquement pour le réseau invité et non pour tout le trafic.

source: **Road Warrior / Remote Access**. Users want to be able to connect securely from a home or office to a private network in the cloud. Typically, the IP address of the connecting client is dynamic and cannot be preconfigured on the VPN server.
fr_fr: **Road Warrior / Accès Distant**. Les utilisateurs veulent pouvoir se connecter en toute sécurité depuis leur domicile ou depuis leur entreprise à un réseau privé du cloud. Typiquement, l'adresse IP du client se connectant est dynamique et ne peut pas être pré-configurée sur le serveur VPN.

source: **Site to Site**. In this scenario, two private subnets are connected over the public Internet with a secure VPN tunnel. The cloud user's subnet (for example, an office network) is connected through a gateway to the network in the cloud. The address of the user's gateway must be preconfigured on the VPN server in the cloud. Note that although L2TP-over-IPsec can be used to set up Site-to-Site VPNs, this is not the primary intent of this feature. For more information, see ":ref:`setting-s2s-vpn-conn`".
fr_fr: **Site à Site**. Dans ce scénario, deux sous-réseaux privés sont connectés via le réseau Internet public par un tunnel VPN sécurisé. Le sous-réseau de l'utilisateur du du cloud (par exemple un réseau d'entreprise) est connecté via une passerelle au réseau du cloud. L'adresse de la passerelle de l'utilisateur doit être préconfigurée sur le serveur VPN du cloud. Notez que, bien que L2TP-over-IPsec puisse être utilisé pour configurer des VPN Site-à-Site, ce n'est pas l'objectif principal de cette fonctionnalité. Pour plus d'informations, voir ":ref:`setting-s2s-vpn-conn`".

source: Configuring Remote Access VPN
fr_fr: Configurer l'Accès Distant VPN

source: To set up VPN for the cloud:
fr_fr: Pour configurer le VPN pour le cloud :

source: Log in to the CloudStack UI as an administrator or end user.
fr_fr: Se connecter à l'interface de CloudStack comme administrateur ou utilisateur final.

source: In the left navigation, click Global Settings.
fr_fr: Dans la barre de navigation à gauche, cliquer sur Paramètres globaux.

source: Set the following global configuration parameters.
fr_fr: Configurer les paramètres de configuration globaux suivants.

source: remote.access.vpn.client.ip.range - The range of IP addresses to be allocated to remote access VPN clients. The first IP in the range is used by the VPN server.
fr_fr: remote.access.vpn.client.ip.range - L'intervalle d'adresses IP à allouer pour l'accès distant des clients VPN. La première adresse IP de l'intervalle est utilisée par le serveur VPN.

source: remote.access.vpn.psk.length - Length of the IPSec key.
fr_fr: remote.access.vpn.psk.length - La longueur de la clé IPSec.

source: remote.access.vpn.user.limit - Maximum number of VPN users per account.
fr_fr: remote.access.vpn.user.limit - Le nombre maximum d'utilisateurs VPN par compte.

source: To enable VPN for a particular network:
fr_fr: Pour activer le VPN pour un réseau particulier :

source: Log in as a user or administrator to the CloudStack UI.
fr_fr: Se connecter en tant qu'utilisateur ou administrateur à l'interface de CloudStack.

source: In the left navigation, click Network.
fr_fr: Dans la barre de navigation de gauche, cliquer sur Réseau.

source: Click the name of the network you want to work with.
fr_fr: Cliquez sur le nom du réseau avec lequel vous souhaitez travailler.

source: Click View IP Addresses.
fr_fr: Cliquez sur Voir adresses IP.

source: Click one of the displayed IP address names.
fr_fr: Cliquer sur une des adresses IP affichées.

source: Click the Enable VPN button. |vpn-icon.png|
fr_fr: Cliquer sur le bouton Activer le VPN. |vpn-icon.png|

source: The IPsec key is displayed in a popup window.
fr_fr: La clé IPsec est affichée dans une fenêtre popup.

source: Configuring Remote Access VPN in VPC
fr_fr: Configurer l'Accès Distant VPN dans un VPC

source: On enabling Remote Access VPN on a VPC, any VPN client present outside the VPC can access VMs present in the VPC by using the Remote VPN connection. The VPN client can be present anywhere except inside the VPC on which the user enabled the Remote Access VPN service.
fr_fr: En autorisant l'Accès Distant VPN sur un VPC, tout client VPN présent en dehors du VPC peut accéder aux VM présentent dans le VPC en utilisant la connection distante VPN. Le client VPN peut être présent n'importe où sauf à l'intérieur du VPC sur lequel l'utilisateur à activé le service d'Accès Distant VPN.

source: To enable VPN for a VPC:
fr_fr: Pour activer le VPN pour un VPC :

source: In the Select view, select VPC.
fr_fr: Dans la vue de Sélection, choisissez VPC.

source: All the VPCs that you have created for the account is listed in the page.
fr_fr: Tous les VPCs que vous avez créés pour ce compte sont listés dans la page.

source: Click the Configure button of the VPC.
fr_fr: Cliquer sur le bouton Configurer du VPC.

source: For each tier, the following options are displayed:
fr_fr: Pour chaque segment, les options suivantes sont affichées :

source: Virtual Machines
fr_fr: Machines Virtuelles

source: The following router information is displayed:
fr_fr: Les informations de routage suivantes sont affichées :

source: Private Gateways
fr_fr: Passerelles privées

source: Public IP Addresses
fr_fr: Adresses IP publiques

source: Site-to-Site VPNs
fr_fr: VPN site à site

source: Network ACL Lists
fr_fr: Listes d'ACL réseau

source: In the Router node, select Public IP Addresses.
fr_fr: Sur le noeud Routeur, sélectionner les adresses IP publiques.

source: The IP Addresses page is displayed.
fr_fr: La page Adresses IP est affichée.

source: Click Source NAT IP address.
fr_fr: Cliquer sur l'adresse IP Source NAT.

source: Click OK to confirm. The IPsec key is displayed in a pop-up window.
fr_fr: Cliquer sur OK pour confirmer. La clé IPsec est affichée dans une fenêtre pop-up.

source: Now, you need to add the VPN users.
fr_fr: Vous devez maintenant ajouter les utilisateurs VPN.

source: Click the Source NAT IP.
fr_fr: Cliquer sur IP NAT Source.

source: Select the VPN tab.
fr_fr: Sélectionner l'onglet VPN.

source: Add the username and the corresponding password of the user you wanted to add.
fr_fr: Ajouter le nom d'utilisateur et le mot de passe correspondant de l'utilisateur que vous désirez ajouter.

source: Click Add.
fr_fr: Cliquer sur Ajouter.

source: Repeat the same steps to add the VPN users.
fr_fr: Répéter les mêmes étapes pour ajouter les utilisateurs VPN.
